{
	"cities": [
	    {
	        "name": "Minsk",
	        "code": "BY",
	        "description": "Minsk is the capital and largest city of the Republic of Belarus, situated on the Svislach and Nyamiha rivers. It is the administrative centre of the Commonwealth of Independent States (CIS). As the national capital, Minsk has a special administrative status in Belarus and is the administrative centre of Minsk Region (voblast) and Minsk raion (district). In 2013, it had a population of 2,002,600. The earliest historical references to Minsk date to the 11th century (1067), when it was noted as a provincial city within the principality of Polotsk. The settlement developed on the rivers. In 1242, Minsk became a part of the Grand Duchy of Lithuania. It received town privileges in 1499. From 1569, it was a capital of the Minsk Voivodship in the Polish–Lithuanian Commonwealth. It was part of a region annexed by the Russian Empire in 1793, as a consequence of the Second Partition of Poland. From 1919 to 1991, after the Russian Revolution, Minsk was the capital of the Byelorussian Soviet Socialist Republic within the Soviet Union. Minsk is located on the southeastern slope of the Minsk Hills, a region of rolling hills running from the southwest (upper reaches of the river Nioman) to the northeast – that is, to Lukomskaye Lake in northwestern Belarus. The average altitude above sea level is 220 metres (720 ft). The physical geography of Minsk was shaped over the two most recent ice ages. The Svislach River, which flows across the city from the northwest to the southeast, is in the urstromtal, an ancient river valley formed by water flowing from melting ice sheets at the end of the last Ice Age. There are six smaller rivers within the city limits, all part of the Black Sea basin."
	    },
	    {
	        "name": "Los Angeles",
	        "code": "US",
	        "description": "Los Angeles officially the City of Los Angeles and often known by its initials L.A., is the second-largest city in the United States after New York City, the most populous city in the state of California, and the county seat of Los Angeles County. Situated in Southern California, Los Angeles is known for its mediterranean climate, ethnic diversity, sprawling metropolis, and as a major center of the American entertainment industry. Los Angeles lies in a large coastal basin surrounded on three sides by mountains reaching up to and over 10,000 feet (3,000 m). Historically home to the Chumash and Tongva, Los Angeles was claimed by Juan Rodríguez Cabrillo for Spain in 1542 along with the rest of what would become Alta California. The city was officially founded on September 4, 1781, by Spanish governor Felipe de Neve. It became a part of Mexico in 1821 following the Mexican War of Independence. In 1848, at the end of the Mexican–American War, Los Angeles and the rest of California were purchased as part of the Treaty of Guadalupe Hidalgo, thereby becoming part of the United States. Los Angeles was incorporated as a municipality on April 4, 1850, five months before California achieved statehood. The city experienced rapid growth with the discovery of oil. The city is the focal point of the larger Los Angeles metropolitan area and the Greater Los Angeles Area region, which contains 13 million[16] and over 18 million people, respectively, as of 2010, making it one of the most populous metropolitan areas in the world as well as the second-largest in the United States. Los Angeles is the seat of Los Angeles County, the most populated county in the United States. The city's inhabitants are referred to as Angelenos. Nicknamed the City of Angels, Los Angeles is a global city with a diverse economy in entertainment, culture, media, fashion, science, sports, technology, education, medicine and research. It has been ranked sixth in the Global Cities Index and 9th Global Economic Power Index. The city is home to renowned institutions covering a broad range of professional and cultural fields and is one of the most substantial economic engines within the United States. The Los Angeles combined statistical area (CSA) has a gross metropolitan product (GMP) of $831 billion (as of 2008), making it the third-largest in the world, after the Greater Tokyo and New York metropolitan areas. Los Angeles includes Hollywood and leads the world in the creation of television productions, video games, and recorded music; it is also one of the leaders in motion picture production. Los Angeles hosted the Summer Olympic Games in 1932 and 1984, and is currently bidding for the 2024 Summer Olympics."
	    },
	    {
	        "name": "Amsterdam",
	        "code": "NL",
	        "description": "Amsterdam is the capital and most populous municipality of the Kingdom of the Netherlands. Its status as the capital is mandated by the Constitution of the Netherlands, although it is not the seat of the government, which is The Hague. Amsterdam has a population of 840,486 within the city proper, 1,337,743 in the urban area, and 2,431,000 in the Amsterdam metropolitan area. The city is located in the province of North Holland in the west of the country, and is also North Holland's largest city. It comprises much of the northern part of the Randstad, one of the larger conurbations in Europe, with a population of approximately 7 million. Amsterdam's name derives from Amstelredamme, indicative of the city's origin as a dam of the river Amstel. Originating as a small fishing village in the late 12th century, Amsterdam became one of the most important ports in the world during the Dutch Golden Age (17th century), a result of its innovative developments in trade. During that time, the city was the leading center for finance and diamonds. In the 19th and 20th centuries the city expanded, and many new neighbourhoods and suburbs were planned and built. The 17th-century canals of Amsterdam and the 19–20th century Defence Line of Amsterdam are on the UNESCO World Heritage List. As the commercial capital of the Netherlands and one of the top financial centres in Europe, Amsterdam is considered an alpha world city by the Globalization and World Cities (GaWC) study group. The city is also the cultural capital of the Netherlands. Many large Dutch institutions have their headquarters there, and seven of the world's 500 largest companies, including Philips and ING, are based in the city. In 2012, Amsterdam was ranked the second best city in which to live by the Economist Intelligence Unit (EIU) and 12th globally on quality of living for environment and infrastructure by Mercer. The city was previously ranked 3rd in innovation by 2thinknow in the Innovation Cities Index 2009. Famous Amsterdam residents included Anne Frank the diarist, the artists Rembrandt van Rijn and Vincent van Gogh, and the philosopher Baruch Spinoza. The Amsterdam Stock Exchange, the oldest stock exchange in the world, is located in the city center. Amsterdam's main attractions, including its historic canals, the Rijksmuseum, the Van Gogh Museum, Stedelijk Museum, Hermitage Amsterdam, Anne Frank House, Amsterdam Museum, its red-light district, and its many cannabis coffee shops draw more than 5 million international visitors annually."
	    },
	    {
	        "name": "Rome",
	        "code": "IT",
	        "description": "Rome is a city and special comune (named Roma Capitale) in Italy. Rome is the capital of Italy and of the Lazio region. With 2.9 million residents in 1,285 km2 (496.1 sq mi), it is also the country's largest and most populated comune and fourth-most populous city in the European Union by population within city limits. The Metropolitan City of Rome has a population of 4.3 million residents. The city is located in the central-western portion of the Italian Peninsula, within Lazio (Latium), along the shores of Tiber river. The Vatican City is an independent country geographically located within the city boundaries of Rome, the only existing example of a country within a city: for this reason Rome has been often defined as capital of two states. Rome's history spans more than two and a half thousand years. While Roman mythology dates the founding of Rome at only around 753 BC, the site has been inhabited for much longer, making it one of the oldest continuously occupied sites in Europe. The city's early population originated from a mix of Latins, Etruscans and Sabines. Eventually, the city successively became the capital of the Roman Kingdom, the Roman Republic and the Roman Empire, and is regarded as one of the birthplaces of Western civilization and by some as the first ever metropolis. It is referred to as Roma Aeterna (The Eternal City) and Caput Mundi (Capital of the World), two central notions in ancient Roman culture. After the fall of the Western Empire, which marked the beginning of the Middle Ages, Rome slowly fell under the political control of the Papacy, which had settled in the city since the 1st century AD, until in the 8th century it became the capital of the Papal States, which lasted until 1870. Beginning with the Renaissance, almost all the popes since Nicholas V (1422–55) pursued coherently along four hundred years an architectonic and urbanistic program aimed to make of the city the world's artistic and cultural center.[8] Due to that, Rome became first one of the major centers of the Italian Renaissance, and then the birthplace of both the Baroque style and Neoclassicism. Famous artists, painters, sculptors and architects made Rome the center of their activity, creating masterpieces throughout the city. In 1871 Rome became the capital of the Kingdom of Italy, and in 1946 that of the Italian Republic. Rome has the status of a global city. Rome ranked in 2014 as the 14th-most-visited city in the world, 3rd most visited in the European Union, and the most popular tourist attraction in Italy. Its historic centre is listed by UNESCO as a World Heritage Site. Monuments and museums such as the Vatican Museums and the Colosseum are among the world's most visited tourist destinations with both locations receiving millions of tourists a year. Rome hosted the 1960 Summer Olympics and is the seat of United Nations' Food and Agriculture Organization (FAO)."
	    },
	    {
	        "name": "Vienna",
	        "code": "AT",
	        "description": "Vienna is the capital and largest city of Austria, and one of the nine states of Austria. Vienna is Austria's primary city, with a population of about 1.8 million (2.6 million within the metropolitan area, nearly one third of Austria's population), and its cultural, economic, and political centre. It is the 7th-largest city by population within city limits in the European Union. Until the beginning of the 20th century it was the largest German-speaking city in the world, and before the splitting of the Austro-Hungarian Empire in World War I the city had 2 million inhabitants. Today it has the second largest number of German speakers after Berlin. Vienna is host to many major international organizations, including the United Nations and OPEC. The city is located in the eastern part of Austria and is close to the borders of the Czech Republic, Slovakia, and Hungary. These regions work together in a European Centrope border region. Along with nearby Bratislava, Vienna forms a metropolitan region with 3 million inhabitants. In 2001, the city centre was designated a UNESCO World Heritage Site. Apart from being regarded as the City of Music because of its musical legacy, Vienna is also said to be The City of Dreams because it was home to the world's first psycho-analyst – Sigmund Freud. The city's roots lie in early Celtic and Roman settlements that transformed into a Medieval and Baroque city, and then the capital of the Austro-Hungarian Empire. It is well known for having played an essential role as a leading European music centre, from the great age of Viennese Classicism through the early part of the 20th century. The historic centre of Vienna is rich in architectural ensembles, including Baroque castles and gardens, and the late-19th-century Ringstraße lined with grand buildings, monuments and parks. Vienna is known for its high quality of life. In a 2005 study of 127 world cities, the Economist Intelligence Unit ranked the city first (in a tie with Vancouver, Canada and San Francisco, US) for the world's most livable cities. Between 2011 and 2015, Vienna was ranked second, behind Melbourne, Australia. For seven consecutive years (2009–2015), the human-resource-consulting firm Mercer ranked Vienna first in its annual Quality of Living survey of hundreds of cities around the world, a title the city still holds in 2015. Monocle's 2015 Quality of Life Survey ranked Vienna second on a list of the top 25 cities in the world to make a base within. The UN-Habitat has classified Vienna as being the most prosperous city in the world in 2012/2013. The city was ranked 1st globally for its culture of innovation in 2007 and 2008, and sixth globally (out of 256 cities) in the 2014 Innovation Cities Index, which analyzed 162 indicators in covering three areas: culture, infrastructure, and markets. Vienna regularly hosts urban planning conferences and is often used as a case study by urban planners."
	    },
	    {
	        "name": "Paris",
	        "code": "FR",
	        "description": "Paris is the capital and most populous city of France. Situated on the river Seine in northern metropolitan France, it is in the centre of the Île-de-France region, also known as the région parisienne, Paris Region. The City of Paris largely retains its one and a half century old administrative boundaries, with an area of 105 km² (41 mi²) and as of 2014 a population of 2,241,346. Together with its suburbs, the whole agglomeration has a population of 10,550,350 (Jan. 2012 census). Paris' metropolitan area spans most of the Île-de-France region and has a population of 12,405,426 (Jan. 2013 census), constituting one-fifth of the population of France. The administrative region covers 12,012 km² (4,638 mi²), with approximately 12 million inhabitants as of 2014, and has its own regional council and president. Paris was founded in the 3rd century BC by a Celtic people called the Parisii, who gave the city its name. By the 12th century, Paris was the largest city in the western world, a prosperous trading centre, and the home of the University of Paris, one of the first in Europe. In the 18th century, it was the centre stage for the French Revolution, and became an important centre of finance, commerce, fashion, science, and the arts, a position it still retains today. Since the 19th century, the built-up area of Paris has grown far beyond its administrative borders. Paris is the home of the most visited art museum in the world, the Louvre, as well as the Musée d'Orsay, noted for its collection of French Impressionist art, and the Musée National d'Art Moderne, a museum of modern and contemporary art. The notable architectural landmarks of Paris include Notre Dame Cathedral (12th century); the Sainte-Chapelle (13th century); the Eiffel Tower (1889); and the Basilica of Sacré-Cœur on Montmartre (1914). In 2014 Paris received 22.4 million visitors, making it one of the world's top tourist destinations.[8] Paris is also known for its fashion, particularly the twice-yearly Paris Fashion Week, and for its haute cuisine, and three-star restaurants. Most of France's major universities and grandes écoles are located in Paris, as are France's major newspapers, including Le Monde, Le Figaro, and Libération. The association football club Paris Saint-Germain and the rugby union club Stade Français are based in Paris. The 80,000-seat Stade de France, built for the 1998 FIFA World Cup, is located just north of Paris in the commune of Saint-Denis. Paris hosts the annual French Open Grand Slam tennis tournament on the red clay of Roland Garros. Paris hosted the 1900 and 1924 Summer Olympics, the 1938 and 1998 FIFA World Cups, and the 2007 Rugby World Cup. Every July, the Tour de France of cycling finishes in the city. The city is also a major rail, highway, and air-transport hub, served by the two international airports Paris-Charles de Gaulle and Paris-Orly. Opened in 1900, the city's subway system, the Paris Métro, serves 4.5 million passengers daily. Paris is the hub of the national road network, and is surrounded by three orbital roads: the Périphérique, the A86 motorway, and the Francilienne motorway in the outer suburbs."
	    },
	    {
	        "name": "Saint Petersburg",
	        "code": "RU",
	        "description": "Saint Petersburg is the second largest city in Russia, politically incorporated as a federal subject (a federal city). Situated on the Neva River, at the head of the Gulf of Finland on the Baltic Sea, it was named Saint Petersburg in 1703. In 1914, the name was changed from Saint Petersburg to Petrograd, in 1924 to Leningrad, and in 1991 back to Saint Petersburg. Tsar Peter the Great founded Saint Petersburg on May 27 1703. Between 1713–1728 and 1732–1918, Saint Petersburg was the imperial capital of Russia. In 1918, the central government bodies moved to Moscow. It is Russia's second-largest city after Moscow, with five million inhabitants in 2012, and an important Russian port on the Baltic Sea. Saint Petersburg is the most Westernized city of Russia, as well as its cultural capital. It is the northernmost city in the world with a population of over one million. The Historic Centre of Saint Petersburg and Related Groups of Monuments constitute a UNESCO World Heritage Site. Saint Petersburg is home to The Hermitage, one of the largest art museums in the world. A large number of foreign consulates, international corporations, banks, and businesses have offices in Saint Petersburg."
	    },
	    {
	        "name": "Istanbul",
	        "code": "TR",
	        "description": "Istanbul historically also known as Constantinople and Byzantium, is the most populous city in Turkey and the country's economic, cultural, and historic center. Istanbul is a transcontinental city in Eurasia, straddling the Bosphorus strait (which separates Europe and Asia) between the Sea of Marmara and the Black Sea. Its commercial and historical center lies on the European side and about a third of its population lives on the Asian side. The city is the administrative center of the Istanbul Metropolitan Municipality (coterminous with Istanbul Province), both hosting a population of around 14 million residents. Istanbul is one of the world's most populous cities and ranks as the world's 7th-largest city proper and the largest European city. Founded under the name of Byzantium on the Sarayburnu promontory around 660 BCE, the city developed to become one of the most significant in history. After its reestablishment as Constantinople in 330 CE, it served as an imperial capital for almost 16 centuries, during the Roman and Byzantine (330–1204 and 1261–1453), the Latin (1204–1261), and the Ottoman (1453–1922) empires. It was instrumental in the advancement of Christianity during Roman and Byzantine times, before the Ottomans conquered the city in 1453 and transformed it into an Islamic stronghold and the seat of the Ottoman Caliphate. Istanbul's strategic position on the historic Silk Road, rail networks to Europe and the Middle East, and the only sea route between the Black Sea and the Mediterranean have produced a cosmopolitan populace, although less so since the establishment of the Turkish Republic in 1923. Overlooked for the new capital Ankara during the interwar period, the city has since regained much of its prominence. The population of the city has increased tenfold since the 1950s, as migrants from across Anatolia have moved in and city limits have expanded to accommodate them. Arts, music, film, and cultural festivals were established at the end of the 20th century and continue to be hosted by the city today."
	    },
	    {
	        "name": "Sofia",
	        "code": "BG",
	        "description": "Sofia is the capital and largest city of Bulgaria. The city has a population of 1.26 million, while over 1.5 million people live in its functional urban area. The city is located at the foot of Vitosha Mountain in the western part of the country, within less than 50 kilometres (31 mi) drive from the Serbian border. Its location in the centre of the Balkan peninsula means that it is the midway between the Black Sea and the Adriatic Sea, whereas the Aegean Sea is the closest to it. Sofia has been an area of human habitation since at least 7000 BCE. Being Bulgaria's primate city, Sofia is a hometown of many of the major local universities, cultural institutions and commercial companies. Sofia is one of the top 10 best places for start-up business in the world, especially in IT technologies. Sofia is Europe's most affordable capital to visit as of 2013."
	    },
	    {
	        "name": "Barcelona",
	        "code": "ES",
	        "description": "Barcelona is the capital city of the autonomous community of Catalonia in the Kingdom of Spain, as well as the country's second most populous municipality, with a population of 1.6 million within city limits. Its urban area extends beyond the administrative city limits with a population of around 4.7 million people,[6] being the seventh-most populous urban area in the European Union after Paris, London, Madrid, the Ruhr area, Berlin, and Milan. It is the largest metropolis on the Mediterranean Sea, located on the coast between the mouths of the rivers Llobregat and Besòs, and bounded to the west by the Serra de Collserola mountain range, the tallest peak of which is 512 metres (1,680 ft) high.  Founded as a Roman city, in the Middle Ages Barcelona became the capital of the County of Barcelona. After merging with the Kingdom of Aragon, Barcelona continued to be an important city in the Crown of Aragon as an economic and administrative center of this Crown and the capital of the Principality of Catalonia. Besieged several times during its history, Barcelona has a rich cultural heritage and is today an important cultural center and a major tourist destination. Particularly renowned are the architectural works of Antoni Gaudí and Lluís Domènech i Montaner, which have been designated UNESCO World Heritage Sites. The headquarters of the Union for the Mediterranean is located in Barcelona. The city is known for hosting the 1992 Summer Olympics as well as world-class conferences and expositions and also many international sport tournaments. Barcelona is one of the world's leading tourist, economic, trade fair and cultural centers, and its influence in commerce, education, entertainment, media, fashion, science, and the arts all contribute to its status as one of the world's major global cities. It is a major cultural and economic center in southwestern Europe, 24th in the world (before Zürich, after Frankfurt) and a financial center. In 2008 it was the fourth most economically powerful city by GDP in the European Union and 35th in the world with GDP amounting to €177 billion. In 2012 Barcelona had a GDP of $170 billion; it is leading Spain in both employment rate and GDP per capita change. In 2009 the city was ranked Europe's third and one of the world's most successful as a city brand. In the same year the city was ranked Europe's fourth best city for business and fastest improving European city, with growth improved by 17% per year, but it has since been in a full recession with declines in both employment and GDP per capita, with some recent signs of the beginning of an economic recovery. Since 2011 Barcelona is a leading smart city in Europe. Barcelona is a transport hub with the Port of Barcelona being one of Europe's principal seaports and busiest European passenger port, an international airport, Barcelona–El Prat Airport, which handles above 40 million passengers per year, an extensive motorway network and a high-speed rail line with a link to France and the rest of Europe."
	    },
	    {
	        "name": "London",
	        "code": "GB",
	        "description": "London is the capital and most populous city of England, Great Britain, and the United Kingdom. On the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia. It was founded by the Romans, who named it Londinium. London's ancient core, the City of London, largely retains its 1.12-square-mile (2.9 km2) medieval boundaries. Since at least the 19th century, London has also referred to the metropolis around this core, which now forms the county of Greater London governed by the Mayor of London and the London Assembly, historically split between Middlesex, Essex, Surrey, Kent, and Hertfordshire. London is a leading global city, in the arts, commerce, education, entertainment, fashion, finance, healthcare, media, professional services, research and development, tourism, and transport. It is one of the world's leading financial centres and has the fifth-or sixth-largest metropolitan area GDP in the world. London is a world cultural capital. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is one of the world's leading investment destinations, hosting more international retailers and ultra high-net-worth individuals than any other city. London's universities form the largest concentration of higher education institutes in Europe, and a 2014 report placed it first in the world university rankings. According to the report London also ranks first in the world in software, multimedia development and design, and shares first position in technology readiness. In 2012, London became the first city to host the modern Summer Olympic Games three times. London has a diverse range of peoples and cultures, and more than 300 languages are spoken within Greater London. Its estimated mid-2015 population was 8,673,713, the largest of any city in the European Union, and accounting for 12.5 per cent of the UK population. London's urban area is the second most populous in the EU, after Paris, with 9,787,426 inhabitants at the 2011 census. The city's metropolitan area is one of the most populous in Europe with 13,879,757 inhabitants, while the Greater London Authority states the population of the city-region (covering a large part of the south east) as 22.7 million. London was the world's most populous city from around 1831 to 1925."
	    }
	]
}
